[
{
"name":"Bali Acoustic Company",
"data" :"We have been working in the field of audio, specifically loudspeakers, and acoustics. Our 17 years of ongoing research and development in designing and fabricating loudspeakers and acoustic products enables us to meet high quality audio and acoustic needs of the society. You may want to have the best audio and acoustics for a small space like your Home Entertainment Space. Or you may need high quality audio and acoustics for a large space like an Auditorium, Concert hall, Conference hall, Audiovisual room, Places of Worship etcetera. Or still you would like to own a world-class Recording Studio. We are a company that has a scientific and professional approach to help you realize your dreams.  Our acoustic designs and audio products are based on the latest scientific research and the state of the art technology to ensure quality sound. At Bali Acoustics, we focus mainly on the sound quality. What makes our speakers produce the highest quality sound? Find out..."
},
{
"name":"ARCHITECTURAL ACOUSTICS",
"data" :"Good acoustics add value to any space which is used by people. The design for good acoustics begins from the architectural drawing stage. It is cost-effective to associate our acoustic designers with the architect when the building is conceived at the drawing board. Associating an acoustic designer earlier than that can help in site selection too. Our acoustic designs are based on the latest acoustic research and established principles in the field of acoustics and psychoacoustics. The designs are verified using EASE computer modeling and simulations. Further, we design the absorbing, diffusing and reflecting acoustic panels needed for the hall, to the desired specifications. The choice for surface finish material is mostly between wood and gypsum. Any colour scheme can also be achieved with these materials. The aesthetics are important and the panels’ shapes, location and finish are chosen to meet the desired final look. We are also equipped with computer based acoustical measurement system to evaluate our acoustic designs. The evaluation is based on major acoustic parameters like, Early Decay Time, Reverberation Time, Clarity etc. We meet audio and acoustics needs of a project on turn-key basis."
},
{
"name":"Home Theatres",
"data" :"Sound and visuals are two effects that shape our personalities. In a modern home we now earmark a space for these functions. This space may be called a home theater or an entertainment space depending on how it is styled, equipped and furnished. We help you style and customize this space as per your interests. The space needs to perform as a virtual theatre/hall for watching movies and music videos or just for listening to recorded live shows. This could be achieved by correct choice of loudspeakers of high quality and suitable audio electronics. Further the room / space is studied for acoustic problems like strong room modes and reverberation time."
},
{
"name":"LOUDSPEAKERS  QUALITY",
"data" :"Technical Features of B.A.C. Loudspeakers: Designing and developing a loudspeaker is an art as well as science. With 15 years of intensive R&D in loudspeaker development we claim our loudspeakers to be the best by all quality standards. We continue to improve the product with new materials and designs in order to give the best to our customers. Box Design & Quality:  The loudspeaker box design is based on driver parameters and loudspeaker mathematical model. The fabrication is done indigenously using the best quality marine plywood. The box is internally well braced minimizing sound coloration. The box shape is suited to the application and is styled for modularity and minimum diffraction from the edges. Driver Units: The driver units used are manufactured in our factory from precision components designed and developed by our technical team. The voice coil is made from high temperature adhesive and using high temperature wire wound on special Kapton former. Aluminum die cast woofer chassis is used for rigidity, higher force factor and better thermal dissipation. The unit is thoroughly tested before fitment. Crossover Networks: The crossover network like any other part of the loudspeaker plays a crucial role in achieving good loudspeaker performance. We design our networks using computer based optimization techniques and measured loudspeaker response in low and high frequency range. All networks are fabricated with in our production facility Testing and Quality Control: The frequency and impedance response of each loudspeaker is measured and ensured with in specifications before its shipping to the user. APPLICATION: Auditorium, Concert Halls, Theatres, Home, Audiovisual rooms, Conference Halls, Cafeteria/Dining Halls, Studio Monitors, Stage Monitors"
},
{
"name":"About Us",
"data" :" Bali Acoustic Company was conceived with an aim to serve the architectural acoustics and high-end quality speaker needs of the society. The core strength of the company lies in research and development and the matching high production standards in all its products. The groundwork for entering the field started in 1986 with study and experimental work of underwater sound propagation and processing of sound signals using digital signal processing and associated analog electronics. However active work in the area of speaker design started in 1992 with the sole aim to produce high quality speakers system. The company invested time and resources focused all its professional skills to develop speakers and architectural acoustics products to ensure that sound reproduction is further supported by good acoustics. The company was registered in 1995 and has been consistently producing high-end speakers and designing for good acoustics. All components of our speaker systems are designed and developed within the company to ensure quality and reliability of our products. Our system design is based on Thiele-Small parameters. The crossovers used are designed for overall uniform speaker response. The air core inductors and quality capacitors are used to minimize distortion. The speaker drivers used are manufactured by us with high precision using quality adhesives. Our speaker enclosure designs and fabrication stand the best technically and in performance. All our products are guaranteed for 5 years and we support them through their life. Our scientific approach in all our designs and products ensures that we upgrade our facilities and design tools from time to time. Our acoustic design is verified with EASE computer modeling and simulations. This  enables us   to fine tune    our designs   and  offer     cost-effective solutions to our customers. We have computer based facility to measure loudspeaker response and acoustic parameters of any space/room/hall. We have also added capability to develop acoustical components like Sound Absorbers, Diffusers and Reflectors to meet demands of any custom design. We are thankful to our customers for their support to help us re-invest in to Research and Development and generate core strength in the area of audio and acoustics with in the country."
}

]