[{
"name":"LOUDSPEAKER Badgers Two Way Satellites",
"img":"img/Loud.jpg",
"specs":["Power 50WattsRMS, 8 OHM","Sensitivity 84dB+/-2db","Woofer5.25inch Sandwich Cone, Tweeter cone: 2.5inch","Beam width: Horizontal 60 degrees (-6db), Vertical 60degrees(-6db)","Optimized Network, Crossover Frequency 7000Hz","Weight: 5Kg ( 11lbs)","Styled enclosure, Very Rigid and Inert Box for Uncoloured sound reproduction","Features: The design is modular and loudspeaker array can formed by using more than one badger. The sides are splayed to avoid re-radiation of reflections inside the enclosure. The loudspeaker front is styled to minimize diffraction from the enclosure. Internal Bracing for rigidity and sound definition. The loudspeaker is designed for high quality sound reproduction. It can be mounted on wall.","Applications : it is an ideal satellite speaker and with a subwoofer shown in photograph above cutting in at 80Hz becomes a seamless sound reproducer for home theatre applications and even as a stereo system. It can also be used to form distributed sound system for large venues like food courts, dining halls and small touring groups performing indoors."]
},
{
"name":"Home Theater Packages",
"img":"img/HTP.jpg",
"specs":["1. Surround Processor & Multi channel amplifiers.","2. DVD Player and Recorder","3. Audio Mixer and Microphone (Needed or those who would like to enjoy live programmes at home with recording facility)","With our professional and technical study of various available brands for the above audio systems devices we help the home theater owner choose the best component as per one's budget.","ACOUSTICS:  The room needs to be acoustically planned for using as a home theatre. One important acoustic parameter is the reverberation time of the room. This may be achieved using home furnishing.  Further one needs to suppress dominant room modes. This requires some computation and acoustic and audio design work. A brief design is offered as complimentary part to all the above home theatre packages."]
},
{
"name":"LOUDSPEAKER - Subwoofers 12 inch, 15inch",
"img":"img/LSWoofers.jpg",
"specs":["Subwoofer 12inch: Power 200WattsRMS, 8 OHM,","Sensitivity 87dB+/-2db, ","Woofer12inch Sandwich Cone,","Crossover Frequency 80Hz Can be varied up to 300Hz. Suggested Optimized crossover at 80Hz., Amplifier with active filter with crossover at 80Hz available to convert stereo listening into 2.1 channels.","Weight: 45Kg ( 99lbs), Cubic enclosure","Very Rigid and Inert Box for Uncoloured sound reproduction.","Features:The design is modular and loudspeaker array can formed by using more than one badger. The sides are splayed to avoid re-radiation of reflections inside the enclosure. The loudspeaker front is styled to minimize diffraction from the enclosure. Internal Bracing for rigidity and sound definition. The loudspeaker is designed for high quality sound reproduction. It can be mounted on wall","Applications: It is an ideal subwoofer that seamlessly integrates lower bass and low frequency effects with other full range loudspeakers. With additional electronic circuitry provided with this subwoofer, one can extract bass below 80Hz from the stereo channels and convert stereo into 2.1 system. In case of 5.1 system the signal is directly fed bypassing the electronic filter. Suitable for theatres, halls as addition to stereo system. It reduces low frequency distortion in the system and improves music dynamics."]
},
{
"name":"LOUDSPEAKER - Column-8-2",
"img":"img/LS_col82.jpg",
"specs":["POWER: 75WattsRMS, 16 OHM / 150 Watts RMS 8 OHM","Sensitivity: 87db,Woofers: 8inch, 2numbers, Tweeters: 3inch Array","Beam width: Horizontal 60 degrees (-6db), Vertical 40degrees(-6db)","Optimized Network, Crossover Frequency 3000Hz,","Weight: 25Kg ( 55lbs","Very Rigid and Inert Box for Uncoloured sound reproduction","Size: (WxDxH in mm)380x420x620","Features: The column design is modular and loudspeaker array can formed by using more than one columns. The sides are splayed to avoid re-radiation of reflections inside the enclosure. The loudspeaker front is styled to minimize diffraction from the enclosure. It is internally braced for rigidity and sound definition. The loudspeaker is designed for high quality sound reproduction. It can be mounted on wall (see picture on left).","Applications: Side sound reinforcement for Large auditoriums, concert halls. Main Speakers for audiovisual Rooms and small halls."]
},
{
"name":"LOUDSPEAKER - Column-8-4",
"img":"img/LS_col84.jpg",
"specs":["Power Rating: 400Watts, 8 Ohm","Woofers: 8inch, 4numbers, Tweeters: 3inch Array 8number","Beam width: Horizontal 60 degrees (-6db), Vertical 20degrees(-6db)","Optimized Network, Crossover Frequency 3000Hz,","Weight: 50Kg ( 110lbs)","Very Rigid and Inert Box for Uncoloured sound reproduction,Size:(WxDxH in mm)380x460x1220","Features: The column design is modular and loudspeaker array can formed by using more than one columns. The sides are splayed to avoid re-radiation of reflections inside the enclosure. The loudspeaker front is styled to minimize diffraction from the enclosure. Internal Bracing for rigidity and sound definition. The loudspeaker is designed for high quality sound reproduction. Can be mounted from ceiling.","Applications: Side sound reinforcement for Large auditoriums, concert halls. Main Speakers for audiovisual Rooms and small halls."]
},
{
"name":"ACOUSTIC PANELS",
"img":"img/panels.jpg",
"specs":["Our acoustic designs are supported by custom designed acoustic panels. For preparing a hall for good acoustics, the acoustic studies and design is the first step. The design works out the specifications for the acoustic panels. These acoustic panels are then fabricated to meet the specifications. We have a team specializing in fabricating acoustic panel.","PANEL MATERIALS: Recommended materials for durability and aesthetics are wood and gypsum. These can be given any color scheme and finish.","TYPES OF ACOUSTIC PANELS: There are three basic types of acoustic panels.","1. Absorbing Panels: Cavity resonance and panel resonance designs are used to make high frequency and low frequency absorbers. The best quality materials are used for ensuring absorption characteristics do not degrade with time. The highest quality wood, Owen Corning fiber glass of desired density and the best quality screws and adhesives are used in our fabrication. The workmanship is of high order.","2. Diffusing Panels: Design follows QRD and PRD theory first proposed by Dr. M.R. Schroeder. These are random depth wells with width designed for diffusing a band of frequencies. In addition to diffusing, these panels can help in lateralizing the sound propagation.","3. Reflecting Panels: We design parabolic reflectors to project sound on distant audience as required by the acoustic design.","SIZES OF PANELS: The standard size of panels is 600mmx600mm, 600mmx1200mm, 600mmx2400mm. However in our acoustic design we custom design the panels and sizes may vary depending on the panels location to meet the aesthetics and specifications."]
}
]